# მომხმარებლისგან რიცხვების მიღება
num1 = int(input("შეიტანეთ პირველი რიცხვი: "))
num2 = int(input("შეიტანეთ მეორე რიცხვი: "))

# ცვლადი რომ ინახოს დაბეჭდილი რიცხვების ჯამი
sum_numbers = 0

# თუ num1 მეტიაო num2-ზე
if num1 > num2:
    for i in range(num2, num1 + 1):  # დიაპაზონი num2-დან num1-მდე (ჩათვლით)
        if i % 2 == 0:  # თუ რიცხვი ლუწია
            print(i)
            sum_numbers += i  # რიცხვი დაემატება ჯამს

# თუ num2 მეტიაო num1-ზე
elif num2 > num1:
    for i in range(num1, num2 + 1):  # დიაპაზონი num1-დან num2-მდე (ჩათვლით)
        if i % 2 != 0:  # თუ რიცხვი კენტია
            print(i)
            sum_numbers += i  # რიცხვი დაემატება ჯამს

# თუ რიცხვები თანაბარია
else:
    print("რიცხვები თანაბარია.")

# დაბეჭდვა ჯამის
print(f"დაბეჭდილი რიცხვების ჯამი: {sum_numbers}")
