# სამი ცვლადის შექმნა და თითოეულში მომხმარებლისგან შემოტანილი რიცხვის შენახვა
num1 = int(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = int(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = int(input("შეიყვანეთ მესამე რიცხვი: "))

# რიცხვების დაბეჭდვა
print("შეიყვანეთ რიცხვები:")
print(num1)
print(num2)
print(num3)

num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))
num3 = float(input("შეიყვანეთ მესამე რიცხვი: "))

print("შეიყვანეთ რიცხვები:")
print(num1)
print(num2)
print(num3)